"""
6. Пользователь вводит номер буквы в алфавите. Определить, какая это
буква.
"""

print('Введиьте номер буквы от 1 до 26')
a = int(input())
b = chr(a + 96)
print(b)
